app/controllers/feedbacks_controller.rb

  def index
    @feedbacks = Feedback.all
---
SELECT "feedbacks".* FROM "feedbacks"

  def create
    @feedback = Feedback.new(feedback_params)

    respond_to do |format|
      if @feedback.save
---
INSERT INTO "feedbacks" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "hello"], ["created_at", "2015-01-08 09:38:18.647359"], ["updated_at", "2015-01-08 09:38:18.647359"]]

  def update
    respond_to do |format|
      if @feedback.update(feedback_params)
---
UPDATE "feedbacks" SET "text" = ?, "updated_at" = ? WHERE "feedbacks"."id" = 5  [["text", "asdewre"], ["updated_at", "2015-01-08 09:39:02.188359"]]

  def destroy
    @feedback.destroy
---
DELETE FROM "feedbacks" WHERE "feedbacks"."id" = ?  [["id", 1]]

    def set_feedback
      @feedback = Feedback.find(params[:id])
---
SELECT  "feedbacks".* FROM "feedbacks"  WHERE "feedbacks"."id" = ? LIMIT 1  [["id", 5]]